Tekla Open API Reference for Tekla Structures 2025
RebarHeaderItem Class
 The RebarHeaderItem class represents an item in the header of the rebar catalog (rebar_database.inp).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.RebarHeaderItem
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class RebarHeaderItem
<SerializableAttribute>
Public Class RebarHeaderItem
The RebarHeaderItem type exposes the following members.
Constructors
Name | Description
RebarHeaderItem
 Initializes a new instance of the RebarHeaderItem class.
Top
Properties
Name | Description
Name
 Gets or sets the name.
PropertyName
 Gets or sets the property name.
Type
 Gets or sets the type.
Units
 Gets or sets the units.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace